namespace Model
{
    public static class CommonInfo
    {
        public enum ConfigStyle
        {
            职称类别 = 1,
            计量单位 = 2,
            药品类别 = 3,
            收费类型 = 4,
            用户权限 = 5,
            生产厂商,
            用法 = 41,
            频率 = 37,
            方案类别 = 56,
            辅助检查 = 84
        }
        public enum UserPowers
        {
            一般权限 = 29,
            中级权限 = 30,
            高级权限 = 31,
            药品查询 = 95,
            库存查询 = 96,
            员工查询 = 97,
            病人查询 = 98,
            密码修改 = 99,
            主题变换 = 100,
            门诊处方 = 101,
            门诊查询 = 102,
            购买查询 = 103,
            基础设置 = 104,
            检查费调整 = 105,
            门诊量查询 = 106,
            药品新增 = 107,
            药品修改 = 108,
            药品删除 = 109,
            库存新增 = 110,
            员工创建 = 111,
            员工修改 = 112,
            员工删除 = 113,
            病人删除 = 114,
        }
    }
}